# ## Отчет по лабораторной работе № 2

#### № группы: `ПМ-2501`

#### Выполнила: `Видерман Александра Сергеевна`

#### Вариант: `3`

### Cодержание:

- [Постановка задач](#1-постановка-задач)
- [Входные и выходные данные](#2-входные-и-выходные-данные)
- [Выбор структуры данных](#3-выбор-структуры-данных)
- [Программа](#4-программа)
- [Анализ правильности решения](#5-анализ-правильности-решения)

### 1. Постановка задачи

> Программа получает на вход 5 чисел X, A, B, C, D, не превыщающих по модулю 2<sup>31</sup>. Нужно определить, 
> через какое количество отверстий сможет пройти шарик заданного диаметра X.
> Будем считать, что шарик прошел через отверстие, если диаметр шарика X меньше или равен диаметру отверстия.
> Если шарик не пройдет какое-то отверстие, то работа будет останавливаться, и будет проверяться следующее значение диаметра шара.

### 2. Входные и выходные данные

#### Данные на вход

На вход программа должна получать 5 целых чисел. Также даны верхняя и нижняя границы получаемых
чисел.

|             | Тип                | min значение    | max значение   |
|-------------|--------------------|-----------------|----------------|
| X (Число 1) |    Целое число     |       1         | 2<sup>31</sup> |
| A (Число 2) |    Целое число     |       0         | 2<sup>31</sup> |
| B (Число 3) |    Целое число     |       0         | 2<sup>31</sup> |
| C (Число 4) |    Целое число     |       0         | 2<sup>31</sup> |
| D (Число 5) |    Целое число     |       0         | 2<sup>31</sup> |

#### Данные на выход

Т.к. программа должна вывести целое число, обозначающие количество отверстий, через которые пройдет шарик, то итоговое значение будет не превышать 4 (количеству отверстий). Итоговое значение будем выводить через переменную count.

|         | Тип                                | min значение | max значение   |
|---------|------------------------------------|--------------|----------------|
|   Итог  |            Целое число             |      0       |       4        |

### 3. Выбор структуры данных

Программа получает 5 целых чисел, не превышающих по модулю 2<sup>31</sup>. Поэтому для их хранения
можно выделить 5 переменных (`x`, `a`, `b`, `c`, `d`) типа `int`.

|             | название переменной | Тип (в Java) | 
|-------------|---------------------|--------------|
| X (Число 1) | `x`                 | `int`        |
| A (Число 2) | `a`                 | `int`        | 
| B (Число 3) | `b`                 | `int`        |
| C (Число 4) | `c`                 | `int`        |
| D (Число 5) | `d`                 | `int`        |

Для вывода результата необязательно его хранить в отдельной переменной, но для удобства я введу переменную count.

### 4. Алгоритм

#### Алгоритм выполнения программы:

1. **Ввод данных:**  
   Программа считывает пять целых чисел, обозначенные как `x`, `a`, `b`, `c`, `d`.

2. **Сравнение чисел:**  
   Программа сравнивает значения `x` с значениями `a`, `b`, `c`, `d`. Если `x` меньше или равен `a`, `b`, `c`, `d`, программа увеличит счетчик count на единицу. Если 
`x` больше `a`, `b`, `c`, `d`, то работа праграммы будет останавливаться, и будет выводиться то значение count, через сколько шар в итоге смог пройти отверстий, затем программа будет ждать проверки следующего значения.
3. **Вывод результата:**  

 #### Блок-схема

 ```mermaid
flowchart TD
    A([Начало]) --> B[/Ввод X, A, B, C, D/]
    B --> C[count = 0]

    C --> D{X ≤ A?}
    D -- Нет --> K[/Вывод count/]
    D -- Да --> E[count = count + 1]

    E --> F{X ≤ B?}
    F -- Нет --> K
    F -- Да --> G[count = count + 1]

    G --> H{X ≤ C?}
    H -- Нет --> K
    H -- Да --> I[count = count + 1]

    I --> J{X ≤ D?}
    J -- Нет --> K
    J -- Да --> L[count = count + 1]
    L --> K

    K --> M([Конец])
```

### 5. Программа

```java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.print("Введите диаметр шарика (X): ");
        int X = scanner.nextInt();
        System.out.print("Введите диаметр первого отверстия (A): ");
        int A = scanner.nextInt();
        System.out.print("Введите диаметр второго отверстия (B): ");
        int B = scanner.nextInt();
        System.out.print("Введите диаметр третьего отверстия (C): ");
        int C = scanner.nextInt();
        System.out.print("Введите диаметр четвертого отверстия (D): ");
        int D = scanner.nextInt();

        int count = 0;

        if (X <= A) {
            count++;
            if (X <= B) {
                count++;
                if (X <= C) {
                    count++;
                    if (X <= D) {
                        count++;
                    }
                }
            }
        }
        if (count == 0 || count == 1 || count == 5) {
            System.out.println("Шарик удастся протащить " + count + " раз");
        }
        if (count == 2 || count == 3 || count == 4) {
            System.out.println("Шарик удастся протащить " + count + " раза");
        }
        scanner.close();
    }
}
```

### 6. Анализ правильности решения

Программа работает корректно на всем множестве решений с учетом ограничений.

1. Тест 1:

    - **Input**:
        ```
        5 2 6 7 8 
        ```

    - **Output**:
        ```
        0
        ```

2. Тест 2:

    - **Input**:
        ```
        5 6 3 4 2 
        ```

    - **Output**:
        ```
        1
        ```

3. Тест 3:

    - **Input**:
        ```
         5 6 7 3 9 
        ```

    - **Output**:
        ```
        2
        ```

4. Тест 4:

    - **Input**:
        ```
        5 6 7 8 3 
        ```

    - **Output**:
        ```
        3
        ```

5. Тест 5:

    - **Input**:
        ```
        5 6 7 8 9
        ```

    - **Output**:
        ```
        4
        ```
