# ## Отчет по лабораторной работе № 1

#### № группы: `ПМ-2501`

#### Выполнила: `Видерман Александра Сергеевна`

#### Вариант: `3`

### Cодержание:

- [Постановка задачи](#1-постановка-задачи)
- [Входные и выходные данные](#2-входные-и-выходные-данные)
- [Выбор структуры данных](#3-выбор-структуры-данных)
- [Алгоритм](#4-алгоритм)
- [Программа](#5-программа)
- [Анализ правильности решения](#6-анализ-правильности-решения)

### 1. Постановка задачи

> Программа получает на вход 5 чисел X, A, B, C, D, не превыщающих по модулю 10<sup>9</sup>. Нужно определить, 
> через какое количество отверстий сможет пройти шарик заданного диаметра X.
> Будем считать, что шарик прошел через отверстие, если диаметр шарика X <= диаметру отверстия.

### 2. Входные и выходные данные

#### Данные на вход

На вход программа должна получать 5 натуральных чисел. Также даны верхняя и нижняя границы получаемых
чисел.

|             | Тип                | min значение    | max значение   |
|-------------|--------------------|-----------------|----------------|
| X (Число 1) | Натуральное число  |       1         | 10<sup>9</sup> |
| A (Число 2) | Натуральное число  |       1         | 10<sup>9</sup> |
| B (Число 3) | Натуральное число  |       1         | 10<sup>9</sup> |
| C (Число 4) | Натуральное число  |       1         | 10<sup>9</sup> |
| D (Число 5) | Натуральное число  |       1         | 10<sup>9</sup> |

#### Данные на выход

Т.к. программа должна вывести целое неотрицательное число, обозначающие количество отверстий, через которые пройдет шарик, то итоговое значение будет не превышать 10<sup>9</sup>. Итоговое значение будем выводить через метод count

|         | Тип                                | min значение | max значение   |
|---------|------------------------------------|--------------|----------------|
| Число 1 | Вещественное неотрицательное число | 0            | 10<sup>9</sup> |

### 3. Выбор структуры данных

Программа получает 5 натуральных чисел, не превышающих по модулю 10<sup>9</sup>. Поэтому для их хранения
можно выделить 5 переменных (`x`, `a`, `b`, `c`, `d`) типа `int`.

|             | название переменной | Тип (в Java) | 
|-------------|---------------------|--------------|
| X (Число 1) | `x`                 | `int`        |
| A (Число 2) | `a`                 | `int`        | 
| B (Число 3) | `b`                 | `int`        |
| C (Число 4) | `c`                 | `int`        |
| D (Число 5) | `d`                 | `int`        |

Для вывода результата необязательно его хранить в отдельной переменной.

### 4. Алгоритм

#### Алгоритм выполнения программы:

1. **Ввод данных:**  
   Программа считывает пять натуральных чисел, обозначенные как `x`, `a`, `b`, `c`, `d`.

2. **Сравнение чисел:**  
   Программа сравнивает значения `x` с значениями `a`, `b`, `c`, `d`. Если `x` меньше или равен `a`, `b`, `c`, `d`, программа увеличит счетчик count на единицу. Если 
`x` больше `a`, `b`, `c`, `d`, то праграмма будет переходить к проверке следующего значения, пока проверит не все.
3. **Вывод результата:**  

 #### Блок-схема

 ```mermaid
 flowchart TD
    A[Начало] --> B[Ввод X, A, B, C, D]
    B --> C[count = 0]
    C --> D{Проверить отверстие A}
    D --> |X <= A| E[count = count + 1]
    D --> |X > A| F[Перейти к B]
    E --> F
    F --> G{Проверить отверстие B}
    G --> |X <= B| H[count = count + 1]
    G --> |X > B| I[Перейти к C]
    H --> I
    I --> J{Проверить отверстие C}
    J --> |X <= C| K[count = count + 1]
    J --> |X > C| L[Перейти к D]
    K --> L
    L --> M{Проверить отверстие D}
    M --> |X <= D| N[count = count + 1]
    M --> |X > D| O[Вывести count]
    N --> O
    O --> P[Конец]

```

### 5. Программа

```java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        // Ввод данных
        System.out.print("Введите диаметр шарика (X): ");
        int X = scanner.nextInt();
        System.out.print("Введите диаметр первого отверстия (A): ");
        int A = scanner.nextInt();
        System.out.print("Введите диаметр второго отверстия (B): ");
        int B = scanner.nextInt();
        System.out.print("Введите диаметр третьего отверстия (C): ");
        int C = scanner.nextInt();
        System.out.print("Введите диаметр четвертого отверстия (D): ");
        int D = scanner.nextInt();

        // Инициализация счетчика
        int count = 0;

        // Проверка каждого отверстия
        if (X <= A) {
            count++;
        }
        if (X <= B) {
            count++;
        }
        if (X <= C) {
            count++;
        }
        if (X <= D) {
            count++;
        }

        // Вывод результата
        System.out.println("Шарик удастся протащить через " + count + " отверстий.");
        
        scanner.close();
    }
}
```

### 6. Анализ правильности решения

Программа работает корректно на всем множестве решений с учетом ограничений.

1. Тест 1:

    - **Input**:
        ```
        `x` = 2, `a`= 4, `b`= 5, `c`= 6, `d`= 8
        ```

    - **Output**:
        ```
        4
        ```

2. Тест 2:

    - **Input**:
        ```
        `x` = 5, `a`= 3, `b`= 6, `c`= 10, `d`= 11
        ```

    - **Output**:
        ```
        3
        ```

3. Тест 3:

    - **Input**:
        ```
        `x` = 8, `a`= 4, `b`= 5, `c`= 10, `d`= 15
        ```

    - **Output**:
        ```
        2
        ```

4. Тест 4:

    - **Input**:
        ```
        `x` = 9, `a`= 4, `b`= 5, `c`= 6, `d`= 13
        ```

    - **Output**:
        ```
        1
        ```

5. Тест 5:

    - **Input**:
        ```
        `x` = 10, `a`= 4, `b`= 5, `c`= 6, `d`= 8
        ```

    - **Output**:
        ```
        0
        ```
